src/app/Helpers/UserHelper.php

select * from "company" where "company"."id" = 1 limit 1
select * from "store" where "store"."id" = 1 limit 1
---
    public static function getUser($user): ?array
    {

        // ログインチェック
        if (!Auth::check()) {
            return null;
        }

        // 初期化
        $userArray = [];

        if ($user) {
            // 所属会社情報取得
            $company = Company::find($user->company_id);

            // 所属店舗情報取得
            $store = Store::find($user->store_id);